GopalSaraf/Practicals/PSDL/include/proc/pic16f913.inc
// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
LCDDATA10                                equ 011Ah
// bitfield definitions
LCDDATA10_SEG8_POSN                      equ 0000h
LCDDATA10_SEG8_POSITION                  equ 0000h
LCDDATA10_SEG8_SIZE                      equ 0001h
LCDDATA10_SEG8_LENGTH                    equ 0001h
LCDDATA10_SEG8_MASK                      equ 0001h
LCDDATA10_SEG9_POSN                      equ 0001h
LCDDATA10_SEG9_POSITION                  equ 0001h
LCDDATA10_SEG9_SIZE                      equ 0001h
LCDDATA10_SEG9_LENGTH                    equ 0001h
LCDDATA10_SEG9_MASK                      equ 0002h
LCDDATA10_SEG10_POSN                     equ 0002h
LCDDATA10_SEG10_POSITION                 equ 0002h
LCDDATA10_SEG10_SIZE                     equ 0001h
LCDDATA10_SEG10_LENGTH                   equ 0001h
LCDDATA10_SEG10_MASK                     equ 0004h
LCDDATA10_SEG11_POSN                     equ 0003h
LCDDATA10_SEG11_POSITION                 equ 0003h
LCDDATA10_SEG11_SIZE                     equ 0001h
LCDDATA10_SEG11_LENGTH                   equ 0001h
LCDDATA10_SEG11_MASK                     equ 0008h
LCDDATA10_SEG12_POSN                     equ 0004h
LCDDATA10_SEG12_POSITION                 equ 0004h
LCDDATA10_SEG12_SIZE                     equ 0001h
LCDDATA10_SEG12_LENGTH                   equ 0001h
LCDDATA10_SEG12_MASK                     equ 0010h
LCDDATA10_SEG13_POSN                     equ 0005h
LCDDATA10_SEG13_POSITION                 equ 0005h
LCDDATA10_SEG13_SIZE                     equ 0001h
LCDDATA10_SEG13_LENGTH                   equ 0001h
LCDDATA10_SEG13_MASK                     equ 0020h
LCDDATA10_SEG14_POSN                     equ 0006h
LCDDATA10_SEG14_POSITION                 equ 0006h
LCDDATA10_SEG14_SIZE                     equ 0001h
LCDDATA10_SEG14_LENGTH                   equ 0001h
LCDDATA10_SEG14_MASK                     equ 0040h
LCDDATA10_SEG15_POSN                     equ 0007h
LCDDATA10_SEG15_POSITION                 equ 0007h
LCDDATA10_SEG15_SIZE                     equ 0001h
LCDDATA10_SEG15_LENGTH                   equ 0001h
LCDDATA10_SEG15_MASK                     equ 0080h
LCDDATA10_SEG8COM3_POSN                  equ 0000h
LCDDATA10_SEG8COM3_POSITION              equ 0000h
LCDDATA10_SEG8COM3_SIZE                  equ 0001h
LCDDATA10_SEG8COM3_LENGTH                equ 0001h
LCDDATA10_SEG8COM3_MASK                  equ 0001h
LCDDATA10_SEG9COM3_POSN                  equ 0001h
LCDDATA10_SEG9COM3_POSITION              equ 0001h
LCDDATA10_SEG9COM3_SIZE                  equ 0001h
LCDDATA10_SEG9COM3_LENGTH                equ 0001h
LCDDATA10_SEG9COM3_MASK                  equ 0002h
LCDDATA10_SEG10COM3_POSN                 equ 0002h
LCDDATA10_SEG10COM3_POSITION             equ 0002h
LCDDATA10_SEG10COM3_SIZE                 equ 0001h
LCDDATA10_SEG10COM3_LENGTH               equ 0001h
LCDDATA10_SEG10COM3_MASK                 equ 0004h
LCDDATA10_SEG11COM3_POSN                 equ 0003h
LCDDATA10_SEG11COM3_POSITION             equ 0003h
LCDDATA10_SEG11COM3_SIZE                 equ 0001h
LCDDATA10_SEG11COM3_LENGTH               equ 0001h
LCDDATA10_SEG11COM3_MASK                 equ 0008h
LCDDATA10_SEG12COM3_POSN                 equ 0004h
LCDDATA10_SEG12COM3_POSITION             equ 0004h
LCDDATA10_SEG12COM3_SIZE                 equ 0001h
LCDDATA10_SEG12COM3_LENGTH               equ 0001h
LCDDATA10_SEG12COM3_MASK                 equ 0010h
LCDDATA10_SEG13COM3_POSN                 equ 0005h
LCDDATA10_SEG13COM3_POSITION             equ 0005h
LCDDATA10_SEG13COM3_SIZE                 equ 0001h
LCDDATA10_SEG13COM3_LENGTH               equ 0001h
LCDDATA10_SEG13COM3_MASK                 equ 0020h
LCDDATA10_SEG14COM3_POSN                 equ 0006h
LCDDATA10_SEG14COM3_POSITION             equ 0006h
LCDDATA10_SEG14COM3_SIZE                 equ 0001h
LCDDATA10_SEG14COM3_LENGTH               equ 0001h
LCDDATA10_SEG14COM3_MASK                 equ 0040h
LCDDATA10_SEG15COM3_POSN                 equ 0007h
LCDDATA10_SEG15COM3_POSITION             equ 0007h
LCDDATA10_SEG15COM3_SIZE                 equ 0001h
LCDDATA10_SEG15COM3_LENGTH               equ 0001h
LCDDATA10_SEG15COM3_MASK                 equ 0080h
LCDDATA10_S8C3_POSN                      equ 0000h
LCDDATA10_S8C3_POSITION                  equ 0000h
LCDDATA10_S8C3_SIZE                      equ 0001h
LCDDATA10_S8C3_LENGTH                    equ 0001h
LCDDATA10_S8C3_MASK                      equ 0001h
LCDDATA10_S9C3_POSN                      equ 0001h
LCDDATA10_S9C3_POSITION                  equ 0001h
LCDDATA10_S9C3_SIZE                      equ 0001h
LCDDATA10_S9C3_LENGTH                    equ 0001h
LCDDATA10_S9C3_MASK                      equ 0002h
LCDDATA10_S10C3_POSN                     equ 0002h
LCDDATA10_S10C3_POSITION                 equ 0002h
LCDDATA10_S10C3_SIZE                     equ 0001h
LCDDATA10_S10C3_LENGTH                   equ 0001h
LCDDATA10_S10C3_MASK                     equ 0004h
LCDDATA10_S11C3_POSN                     equ 0003h
LCDDATA10_S11C3_POSITION                 equ 0003h
LCDDATA10_S11C3_SIZE                     equ 0001h
LCDDATA10_S11C3_LENGTH                   equ 0001h
LCDDATA10_S11C3_MASK                     equ 0008h
LCDDATA10_S12C3_POSN                     equ 0004h
LCDDATA10_S12C3_POSITION                 equ 0004h
LCDDATA10_S12C3_SIZE                     equ 0001h
LCDDATA10_S12C3_LENGTH                   equ 0001h
LCDDATA10_S12C3_MASK                     equ 0010h
LCDDATA10_S13C3_POSN                     equ 0005h
LCDDATA10_S13C3_POSITION                 equ 0005h
LCDDATA10_S13C3_SIZE                     equ 0001h
LCDDATA10_S13C3_LENGTH                   equ 0001h
LCDDATA10_S13C3_MASK                     equ 0020h
LCDDATA10_S14C3_POSN                     equ 0006h
LCDDATA10_S14C3_POSITION                 equ 0006h
LCDDATA10_S14C3_SIZE                     equ 0001h
LCDDATA10_S14C3_LENGTH                   equ 0001h
LCDDATA10_S14C3_MASK                     equ 0040h
LCDDATA10_S15C3_POSN                     equ 0007h
LCDDATA10_S15C3_POSITION                 equ 0007h
LCDDATA10_S15C3_SIZE                     equ 0001h
LCDDATA10_S15C3_LENGTH                   equ 0001h
LCDDATA10_S15C3_MASK                     equ 0080h

// Register: LCDSE0
#define LCDSE0 LCDSE0
LCDSE0                                   equ 011Ch
// bitfield definitions
LCDSE0_SEG0_POSN                         equ 0000h
LCDSE0_SEG0_POSITION                     equ 0000h
LCDSE0_SEG0_SIZE                         equ 0001h
LCDSE0_SEG0_LENGTH                       equ 0001h
LCDSE0_SEG0_MASK                         equ 0001h
LCDSE0_SEG1_POSN                         equ 0001h
LCDSE0_SEG1_POSITION                     equ 0001h
LCDSE0_SEG1_SIZE                         equ 0001h
LCDSE0_SEG1_LENGTH                       equ 0001h
LCDSE0_SEG1_MASK                         equ 0002h
LCDSE0_SEG2_POSN                         equ 0002h
LCDSE0_SEG2_POSITION                     equ 0002h
LCDSE0_SEG2_SIZE                         equ 0001h
LCDSE0_SEG2_LENGTH                       equ 0001h
LCDSE0_SEG2_MASK                         equ 0004h
LCDSE0_SEG3_POSN                         equ 0003h
LCDSE0_SEG3_POSITION                     equ 0003h
LCDSE0_SEG3_SIZE                         equ 0001h
LCDSE0_SEG3_LENGTH                       equ 0001h
LCDSE0_SEG3_MASK                         equ 0008h
LCDSE0_SEG4_POSN                         equ 0004h
LCDSE0_SEG4_POSITION                     equ 0004h
LCDSE0_SEG4_SIZE                         equ 0001h
LCDSE0_SEG4_LENGTH                       equ 0001h
LCDSE0_SEG4_MASK                         equ 0010h
LCDSE0_SEG5_POSN                         equ 0005h
LCDSE0_SEG5_POSITION                     equ 0005h
LCDSE0_SEG5_SIZE                         equ 0001h
LCDSE0_SEG5_LENGTH                       equ 0001h
LCDSE0_SEG5_MASK                         equ 0020h
LCDSE0_SEG6_POSN                         equ 0006h
LCDSE0_SEG6_POSITION                     equ 0006h
LCDSE0_SEG6_SIZE                         equ 0001h
LCDSE0_SEG6_LENGTH                       equ 0001h
LCDSE0_SEG6_MASK                         equ 0040h
LCDSE0_SEG7_POSN                         equ 0007h
LCDSE0_SEG7_POSITION                     equ 0007h
LCDSE0_SEG7_SIZE                         equ 0001h
LCDSE0_SEG7_LENGTH                       equ 0001h
LCDSE0_SEG7_MASK                         equ 0080h
LCDSE0_SE0_POSN                          equ 0000h
LCDSE0_SE0_POSITION                      equ 0000h
LCDSE0_SE0_SIZE                          equ 0001h
LCDSE0_SE0_LENGTH                        equ 0001h
LCDSE0_SE0_MASK                          equ 0001h
LCDSE0_SE1_POSN                          equ 0001h
LCDSE0_SE1_POSITION                      equ 0001h
LCDSE0_SE1_SIZE                          equ 0001h
LCDSE0_SE1_LENGTH                        equ 0001h
LCDSE0_SE1_MASK                          equ 0002h
LCDSE0_SE2_POSN                          equ 0002h
LCDSE0_SE2_POSITION                      equ 0002h
LCDSE0_SE2_SIZE                          equ 0001h
LCDSE0_SE2_LENGTH                        equ 0001h
LCDSE0_SE2_MASK                          equ 0004h
LCDSE0_SE3_POSN                          equ 0003h
LCDSE0_SE3_POSITION                      equ 0003h
LCDSE0_SE3_SIZE                          equ 0001h
LCDSE0_SE3_LENGTH                        equ 0001h
LCDSE0_SE3_MASK                          equ 0008h
LCDSE0_SE4_POSN                          equ 0004h
LCDSE0_SE4_POSITION                      equ 0004h
LCDSE0_SE4_SIZE                          equ 0001h
LCDSE0_SE4_LENGTH                        equ 0001h
LCDSE0_SE4_MASK                          equ 0010h
LCDSE0_SE5_POSN                          equ 0005h
LCDSE0_SE5_POSITION                      equ 0005h
LCDSE0_SE5_SIZE                          equ 0001h
LCDSE0_SE5_LENGTH                        equ 0001h
LCDSE0_SE5_MASK                          equ 0020h
LCDSE0_SE6_POSN                          equ 0006h
LCDSE0_SE6_POSITION                      equ 0006h
LCDSE0_SE6_SIZE                          equ 0001h
LCDSE0_SE6_LENGTH                        equ 0001h
LCDSE0_SE6_MASK                          equ 0040h
LCDSE0_SE7_POSN                          equ 0007h
LCDSE0_SE7_POSITION                      equ 0007h
LCDSE0_SE7_SIZE                          equ 0001h
LCDSE0_SE7_LENGTH                        equ 0001h
LCDSE0_SE7_MASK                          equ 0080h
LCDSE0_SEGEN0_POSN                       equ 0000h
LCDSE0_SEGEN0_POSITION                   equ 0000h
LCDSE0_SEGEN0_SIZE                       equ 0001h
LCDSE0_SEGEN0_LENGTH                     equ 0001h
LCDSE0_SEGEN0_MASK                       equ 0001h
LCDSE0_SEGEN1_POSN                       equ 0001h
LCDSE0_SEGEN1_POSITION                   equ 0001h
LCDSE0_SEGEN1_SIZE                       equ 0001h
LCDSE0_SEGEN1_LENGTH                     equ 0001h
LCDSE0_SEGEN1_MASK                       equ 0002h
LCDSE0_SEGEN2_POSN                       equ 0002h
LCDSE0_SEGEN2_POSITION                   equ 0002h
LCDSE0_SEGEN2_SIZE                       equ 0001h
LCDSE0_SEGEN2_LENGTH                     equ 0001h
LCDSE0_SEGEN2_MASK                       equ 0004h
LCDSE0_SEGEN3_POSN                       equ 0003h
LCDSE0_SEGEN3_POSITION                   equ 0003h
LCDSE0_SEGEN3_SIZE                       equ 0001h
LCDSE0_SEGEN3_LENGTH                     equ 0001h
LCDSE0_SEGEN3_MASK                       equ 0008h
LCDSE0_SEGEN4_POSN                       equ 0004h
LCDSE0_SEGEN4_POSITION                   equ 0004h
LCDSE0_SEGEN4_SIZE                       equ 0001h
LCDSE0_SEGEN4_LENGTH                     equ 0001h
LCDSE0_SEGEN4_MASK                       equ 0010h
LCDSE0_SEGEN5_POSN                       equ 0005h
LCDSE0_SEGEN5_POSITION                   equ 0005h
LCDSE0_SEGEN5_SIZE                       equ 0001h
LCDSE0_SEGEN5_LENGTH                     equ 0001h
LCDSE0_SEGEN5_MASK                       equ 0020h
LCDSE0_SEGEN6_POSN                       equ 0006h
LCDSE0_SEGEN6_POSITION                   equ 0006h
LCDSE0_SEGEN6_SIZE                       equ 0001h
LCDSE0_SEGEN6_LENGTH                     equ 0001h
LCDSE0_SEGEN6_MASK                       equ 0040h
LCDSE0_SEGEN7_POSN                       equ 0007h
LCDSE0_SEGEN7_POSITION                   equ 0007h
LCDSE0_SEGEN7_SIZE                       equ 0001h
LCDSE0_SEGEN7_LENGTH                     equ 0001h
LCDSE0_SEGEN7_MASK                       equ 0080h

// Register: LCDSE1
#define LCDSE1 LCDSE1
LCDSE1                                   equ 011Dh
// bitfield definitions
LCDSE1_SEG8_POSN                         equ 0000h
LCDSE1_SEG8_POSITION                     equ 0000h
LCDSE1_SEG8_SIZE                         equ 0001h
LCDSE1_SEG8_LENGTH                       equ 0001h
LCDSE1_SEG8_MASK                         equ 0001h
LCDSE1_SEG9_POSN                         equ 0001h
LCDSE1_SEG9_POSITION                     equ 0001h
LCDSE1_SEG9_SIZE                         equ 0001h
LCDSE1_SEG9_LENGTH                       equ 0001h
LCDSE1_SEG9_MASK                         equ 0002h
LCDSE1_SEG10_POSN                        equ 0002h
LCDSE1_SEG10_POSITION                    equ 0002h
LCDSE1_SEG10_SIZE                        equ 0001h
LCDSE1_SEG10_LENGTH                      equ 0001h
LCDSE1_SEG10_MASK                        equ 0004h
LCDSE1_SEG11_POSN                        equ 0003h
LCDSE1_SEG11_POSITION                    equ 0003h
LCDSE1_SEG11_SIZE                        equ 0001h
LCDSE1_SEG11_LENGTH                      equ 0001h
LCDSE1_SEG11_MASK                        equ 0008h
LCDSE1_SEG12_POSN                        equ 0004h
LCDSE1_SEG12_POSITION                    equ 0004h
LCDSE1_SEG12_SIZE                        equ 0001h
LCDSE1_SEG12_LENGTH                      equ 0001h
LCDSE1_SEG12_MASK                        equ 0010h
LCDSE1_SEG13_POSN                        equ 0005h
LCDSE1_SEG13_POSITION                    equ 0005h
LCDSE1_SEG13_SIZE                        equ 0001h
LCDSE1_SEG13_LENGTH                      equ 0001h
LCDSE1_SEG13_MASK                        equ 0020h
LCDSE1_SEG14_POSN                        equ 0006h
LCDSE1_SEG14_POSITION                    equ 0006h
LCDSE1_SEG14_SIZE                        equ 0001h
LCDSE1_SEG14_LENGTH                      equ 0001h
LCDSE1_SEG14_MASK                        equ 0040h
LCDSE1_SEG15_POSN                        equ 0007h
LCDSE1_SEG15_POSITION                    equ 0007h
LCDSE1_SEG15_SIZE                        equ 0001h
LCDSE1_SEG15_LENGTH                      equ 0001h
LCDSE1_SEG15_MASK                        equ 0080h
LCDSE1_SE8_POSN                          equ 0000h
LCDSE1_SE8_POSITION                      equ 0000h
LCDSE1_SE8_SIZE                          equ 0001h
LCDSE1_SE8_LENGTH                        equ 0001h
LCDSE1_SE8_MASK                          equ 0001h
LCDSE1_SE9_POSN                          equ 0001h
LCDSE1_SE9_POSITION                      equ 0001h
LCDSE1_SE9_SIZE                          equ 0001h
LCDSE1_SE9_LENGTH                        equ 0001h
LCDSE1_SE9_MASK                          equ 0002h
LCDSE1_SE10_POSN                         equ 0002h
LCDSE1_SE10_POSITION                     equ 0002h
LCDSE1_SE10_SIZE                         equ 0001h
LCDSE1_SE10_LENGTH                       equ 0001h
LCDSE1_SE10_MASK                         equ 0004h
LCDSE1_SE11_POSN                         equ 0003h
LCDSE1_SE11_POSITION                     equ 0003h
LCDSE1_SE11_SIZE                         equ 0001h
LCDSE1_SE11_LENGTH                       equ 0001h
LCDSE1_SE11_MASK                         equ 0008h
LCDSE1_SE12_POSN                         equ 0004h
LCDSE1_SE12_POSITION                     equ 0004h
LCDSE1_SE12_SIZE                         equ 0001h
LCDSE1_SE12_LENGTH                       equ 0001h
LCDSE1_SE12_MASK                         equ 0010h
LCDSE1_SE13_POSN                         equ 0005h
LCDSE1_SE13_POSITION                     equ 0005h
LCDSE1_SE13_SIZE                         equ 0001h
LCDSE1_SE13_LENGTH                       equ 0001h
LCDSE1_SE13_MASK                         equ 0020h
LCDSE1_SE14_POSN                         equ 0006h
LCDSE1_SE14_POSITION                     equ 0006h
LCDSE1_SE14_SIZE                         equ 0001h
LCDSE1_SE14_LENGTH                       equ 0001h
LCDSE1_SE14_MASK                         equ 0040h
LCDSE1_SE15_POSN                         equ 0007h
LCDSE1_SE15_POSITION                     equ 0007h
LCDSE1_SE15_SIZE                         equ 0001h
LCDSE1_SE15_LENGTH                       equ 0001h
LCDSE1_SE15_MASK                         equ 0080h
LCDSE1_SEGEN8_POSN                       equ 0000h
LCDSE1_SEGEN8_POSITION                   equ 0000h
LCDSE1_SEGEN8_SIZE                       equ 0001h
LCDSE1_SEGEN8_LENGTH                     equ 0001h
LCDSE1_SEGEN8_MASK                       equ 0001h
LCDSE1_SEGEN9_POSN                       equ 0001h
LCDSE1_SEGEN9_POSITION                   equ 0001h
LCDSE1_SEGEN9_SIZE                       equ 0001h
LCDSE1_SEGEN9_LENGTH                     equ 0001h
LCDSE1_SEGEN9_MASK                       equ 0002h
LCDSE1_SEGEN10_POSN                      equ 0002h
LCDSE1_SEGEN10_POSITION                  equ 0002h
LCDSE1_SEGEN10_SIZE                      equ 0001h
LCDSE1_SEGEN10_LENGTH                    equ 0001h
LCDSE1_SEGEN10_MASK                      equ 0004h
LCDSE1_SEGEN11_POSN                      equ 0003h
LCDSE1_SEGEN11_POSITION                  equ 0003h
LCDSE1_SEGEN11_SIZE                      equ 0001h
LCDSE1_SEGEN11_LENGTH                    equ 0001h
LCDSE1_SEGEN11_MASK                      equ 0008h
LCDSE1_SEGEN12_POSN                      equ 0004h
LCDSE1_SEGEN12_POSITION                  equ 0004h
LCDSE1_SEGEN12_SIZE                      equ 0001h
LCDSE1_SEGEN12_LENGTH                    equ 0001h
LCDSE1_SEGEN12_MASK                      equ 0010h
LCDSE1_SEGEN13_POSN                      equ 0005h
LCDSE1_SEGEN13_POSITION                  equ 0005h
LCDSE1_SEGEN13_SIZE                      equ 0001h
LCDSE1_SEGEN13_LENGTH                    equ 0001h
LCDSE1_SEGEN13_MASK                      equ 0020h
LCDSE1_SEGEN14_POSN                      equ 0006h
LCDSE1_SEGEN14_POSITION                  equ 0006h
LCDSE1_SEGEN14_SIZE                      equ 0001h
LCDSE1_SEGEN14_LENGTH                    equ 0001h
LCDSE1_SEGEN14_MASK                      equ 0040h
LCDSE1_SEGEN15_POSN                      equ 0007h
LCDSE1_SEGEN15_POSITION                  equ 0007h
LCDSE1_SEGEN15_SIZE                      equ 0001h
LCDSE1_SEGEN15_LENGTH                    equ 0001h
LCDSE1_SEGEN15_MASK                      equ 0080h

// Register: EECON1
#define EECON1 EECON1
EECON1                                   equ 018Ch
// bitfield definitions
EECON1_RD_POSN                           equ 0000h
EECON1_RD_POSITION                       equ 0000h
EECON1_RD_SIZE                           equ 0001h
EECON1_RD_LENGTH                         equ 0001h
EECON1_RD_MASK                           equ 0001h
EECON1_WR_POSN                           equ 0001h
EECON1_WR_POSITION                       equ 0001h
EECON1_WR_SIZE                           equ 0001h
EECON1_WR_LENGTH                         equ 0001h
EECON1_WR_MASK                           equ 0002h
EECON1_WREN_POSN                         equ 0002h
EECON1_WREN_POSITION                     equ 0002h
EECON1_WREN_SIZE                         equ 0001h
EECON1_WREN_LENGTH                       equ 0001h
EECON1_WREN_MASK                         equ 0004h
EECON1_WRERR_POSN                        equ 0003h
EECON1_WRERR_POSITION                    equ 0003h
EECON1_WRERR_SIZE                        equ 0001h
EECON1_WRERR_LENGTH                      equ 0001h
EECON1_WRERR_MASK                        equ 0008h
EECON1_EEPGD_POSN                        equ 0007h
EECON1_EEPGD_POSITION                    equ 0007h
EECON1_EEPGD_SIZE                        equ 0001h
EECON1_EEPGD_LENGTH                      equ 0001h
EECON1_EEPGD_MASK                        equ 0080h
EECON1_EERD_POSN                         equ 0000h
EECON1_EERD_POSITION                     equ 0000h
EECON1_EERD_SIZE                         equ 0001h
EECON1_EERD_LENGTH                       equ 0001h
EECON1_EERD_MASK                         equ 0001h
EECON1_EEWR_POSN                         equ 0001h
EECON1_EEWR_POSITION                     equ 0001h
EECON1_EEWR_SIZE                         equ 0001h
EECON1_EEWR_LENGTH                       equ 0001h
EECON1_EEWR_MASK                         equ 0002h

// Register: EECON2
#define EECON2 EECON2
EECON2                                   equ 018Dh

